BAS BMEKZU Project/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС14</name>
    <comment>(Общ) Ставка НДС 14%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СпецСт8</name>
    <comment>20% сх</comment>
  </enumValues>
  <enumValues>
    <name>НеНДС</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/CommonModules/УчетНДСПереопределяемый/Module.bsl
// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.СпецСт8 Тогда  // ИНАГРО
		Возврат 20;
	КонецЕсли;

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		Возврат 7;
	КонецЕсли;
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС14 Тогда
		Возврат 14;
	КонецЕсли;
	
	Возврат 0;

КонецФункции
